lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
						</field>
						<field>
							<name>CMD_PHASE</name>
							<description>Command phase action</description>
							<bitRange>[15:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WRITE</name>
									<description>Write</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READ</name>
									<description>Read</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMMAND</name>
									<description>Command</description>
									<value>0x05</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CODE_WDATA</name>
							<description>This is a multi-purpose field. When CMD_PHASE is Command or Read, this field contains the code for the command (CMD_CODE). When CMD_PHASE is Write, this field contains the command write data (CMD_WDATA).</description>
							<bitRange>[23:16]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:24]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CMDDATA</name>
					<description>USB Command Data</description>
					<addressOffset>0x14</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD_RDATA</name>
							<description>Command Read Data.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATA</name>
					<description>USB Receive Data</description>
					<addressOffset>0x18</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX_DATA</name>
							<description>Data received.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDATA</name>
					<description>USB Transmit Data</description>
					<addressOffset>0x1C</addressOffset>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX_DATA</name>
							<description>Transmit Data.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RXPLEN</name>
					<description>USB Receive Packet Length</description>
					<addressOffset>0x20</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PKT_LNGTH</name>
							<description>The remaining number of bytes to be read from the currently selected endpoint's buffer. When this field decrements to 0, the RxENDPKT bit will be set in USBDevIntSt.</description>
							<bitRange>[9:0]</bitRange>

						</field>
						<field>
							<name>DV</name>
							<description>Data valid. This bit is useful for isochronous endpoints. Non-isochronous endpoints do not raise an interrupt when an erroneous data packet is received. But invalid data packet can be produced with a bus reset. For isochronous endpoints, data transfer will happen even if an erroneous packet is received. In this case DV bit will not be set for the packet.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DATA_IS_INVALID_</name>
									<description>Data is invalid.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_IS_VALID_</name>
									<description>Data is valid.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:11]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>TXPLENn</name>
					<description>USB Transmit Packet Length</description>
					<addressOffset>0x24</addressOffset>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PKT_LNGTH</name>
							<description>The remaining number of bytes to be written to the selected endpoint buffer. This field is decremented by 4 by hardware after each write to USBTxData. When this field decrements to 0, the TxENDPKT bit will be set in USBDevIntSt.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>USB Control</description>
					<addressOffset>0x28</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RD_EN</name>
							<description>Read mode control. Enables reading data from the OUT endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBRxData register. This bit is cleared by hardware when the last word of the current packet is read from USBRxData.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READ_MODE_IS_DISABLE</name>
									<description>Read mode is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READ_MODE_IS_ENABLED</name>
									<description>Read mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WR_EN</name>
							<description>Write mode control. Enables writing data to the IN endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBTxData register. This bit is cleared by hardware when the number of bytes in USBTxLen have been sent.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WRITE_MODE_IS_DISABL</name>
									<description>Write mode is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE_MODE_IS_ENABLE</name>
									<description>Write mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOG_ENDPOINT</name>
							<description>Logical Endpoint number.</description>
							<bitRange>[5:2]</bitRange>

