lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>DEVFIQSEL</name>
					<description>USB Device FIQ select</description>
					<addressOffset>0x2C</addressOffset>
					<access>write-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME</name>
							<description>This interrupt comes from a 1 KHz free running clock resynchronized on the incoming SoF tokens. This is to be used for isochronous packet transfer.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOWPRIORITY</name>
									<description>FRAME interrupt will be routed to the low-priority interrupt line IRQ.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHPRIORITY</name>
									<description>FRAME interrupt will be routed to the high-priority interrupt line FIQ.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BULKOUT</name>
							<description>Interrupt routing for bulk out endpoints  For logical endpoint 3 (physical endpoints 6 and 7) only.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOWPRIORITY</name>
									<description>BULKOUT interrupt will be routed to the low-priority interrupt line IRQ.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHPRIORITY</name>
									<description>BULKOUT interrupt will be routed to the high-priority interrupt line FIQ.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BULKIN</name>
							<description>Interrupt routing for bulk in endpoints  For logical endpoint 3 (physical endpoints 6 and 7) only.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOWPRIORITY</name>
									<description>BULKIN interrupt will be routed to the low-priority interrupt line IRQ.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGHPRIORITY</name>
									<description>BULKIN interrupt will be routed to the high-priority interrupt line FIQ.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>      <name>PMU</name>
			<description>Power Management Unit (PMU)</description>
			<groupName>PMU</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PCON</name>
					<description>Power control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write 1 to this bit.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>DPDEN</name>
							<description>Deep power-down mode enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLEEP_DEEPSLEEP</name>
									<description>ARM WFI will enter Sleep or Deep-sleep mode (clock to ARM Cortex-M3 core turned off).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEPPOWERDOWN</name>
									<description>ARM WFI will enter Deep-power down mode (ARM Cortex-M3 core powered-down).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[7:2]</bitRange>

						</field>
						<field>
							<name>SLEEPFLAG</name>
							<description>Sleep mode flag</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_POWER_DOWN_</name>
									<description>Read: No power-down mode entered. LPC13xx is in Run mode. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERDOWN</name>
									<description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[10:9]</bitRange>

						</field>
						<field>
							<name>DPDFLAG</name>
							<description>Deep power-down flag</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_DEEPPOWERDOWN</name>
									<description>Read: Deep power-down mode  not entered. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEPPOWERDOWN</name>
									<description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[31:12]</bitRange>

