lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
						</field>
					</fields>
				</register>
				<register>
					<name>DCD_LOC</name>
					<description>DCD pin location select register</description>
					<addressOffset>0x0B8</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DCDLOC</name>
							<description>Selects pin location for DCD pin (this register is only used for parts LPC1311/01 and LPC1313/01).</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_DCD_FUNCTION</name>
									<description>Selects DCD function in pin location PIO2_2/DCD/MISO1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_DCD_FUNCTIO</name>
									<description>Selects  DCD function in pin location PIO3_2/DCD.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:2]</bitRange>


						</field>
					</fields>
				</register>
				<register>
					<name>RI_LOC</name>
					<description>RI pin location register</description>
					<addressOffset>0x0BC</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RILOC</name>
							<description>Selects pin location for RI pin (this register is only used for parts LPC1311/01 and LPC1313/01)</description>
							<bitRange>[1:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>SELECTS_RI_FUNCTION_</name>
									<description>Selects RI function in pin location PIO2_3/RI/MOSI1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_RI_FUNCTION_</name>
									<description>Selects RI function in pin location PIO3_3/RI.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:2]</bitRange>


						</field>
					</fields>
				</register>


			</registers>
		</peripheral>
		<peripheral>      <name>SYSCON</name>
			<description>System configuration </description>
			<groupName>SYSCON</groupName>
			<baseAddress>0x40048000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PIO0_0</name>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>PIO0_1</name>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>PIO0_2</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>PIO0_3</name>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>PIO0_4</name>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>PIO0_5</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>PIO0_6</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>PIO0_7</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>PIO0_8</name>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>PIO0_9</name>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>PIO0_10</name>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>PIO0_11</name>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>PIO1_0</name>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>PIO1_1</name>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>PIO1_2</name>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>PIO1_3</name>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>PIO1_4</name>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>PIO1_5</name>
				<value>17</value>
			</interrupt>
			<interrupt>
				<name>PIO1_6</name>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>PIO1_7</name>
				<value>19</value>
			</interrupt>
			<interrupt>
				<name>PIO1_8</name>
				<value>20</value>
			</interrupt>
			<interrupt>
				<name>PIO1_9</name>
				<value>21</value>
			</interrupt>
			<interrupt>
				<name>PIO1_10</name>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>PIO1_11</name>
				<value>23</value>
			</interrupt>
			<interrupt>
				<name>PIO2_0</name>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>PIO2_1</name>
				<value>25</value>
			</interrupt>
			<interrupt>
				<name>PIO2_2</name>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>PIO2_3</name>
				<value>27</value>
			</interrupt>
			<interrupt>
				<name>PIO2_4</name>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>PIO2_5</name>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>PIO2_6</name>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>PIO2_7</name>
				<value>31</value>
			</interrupt>
			<interrupt>
				<name>PIO2_8</name>
				<value>32</value>
			</interrupt>
			<interrupt>
				<name>PIO2_9</name>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>PIO2_10</name>
				<value>34</value>
			</interrupt>
			<interrupt>
				<name>PIO2_11</name>
				<value>35</value>
			</interrupt>
			<interrupt>
				<name>PIO3_0</name>
				<value>36</value>
			</interrupt>
			<interrupt>
				<name>PIO3_1</name>
				<value>37</value>
			</interrupt>
			<interrupt>
				<name>PIO3_2</name>
				<value>38</value>
			</interrupt>
			<interrupt>
				<name>PIO3_3</name>
				<value>39</value>
			</interrupt>
			<interrupt>
				<name>BOD</name>
				<value>51</value>
			</interrupt>

