lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
						</field>
					</fields>
				</register>
				<register>
					<name>IRCCTRL</name>
					<description>IRC control</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIM</name>
							<description>Trim value</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSRESSTAT</name>
					<description>System reset status register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POR</name>
							<description>POR reset status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_POR_DETECTED</name>
									<description>No POR detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POR_DETECTED</name>
									<description>POR detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>Status of the external RESET pin</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESET_EVENT_DETEC</name>
									<description>No RESET event detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_DETECTED</name>
									<description>RESET detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>Status of the Watchdog reset</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_WDT_RESET_DETECTE</name>
									<description>No WDT reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WDT_RESET_DETECTED</name>
									<description>WDT reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD</name>
							<description>Status of the Brown-out detect reset</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_BOD_RESET_DETECTE</name>
									<description>No BOD reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOD_RESET_DETECTED</name>
									<description>BOD reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRST</name>
							<description>Status of the software system reset. The ARM software reset has the same effect as the hardware reset using the  RESET pin.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_SYSTEM_RESET_DETE</name>
									<description>No System reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_RESET_DETECTE</name>
									<description>System reset detected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:5]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCLKSEL</name>
					<description>System PLL clock source select</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>System PLL clock source</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC oscillator</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_OSCILLATOR</name>
									<description>System oscillator</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCLKUEN</name>
					<description>System PLL clock source update enable</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA</name>
							<description>Enable system PLL clock source update</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>No change</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPDATE_CLOCK_SOURCE</name>
									<description>Update clock source</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>

