lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
				<register>
					<name>STARTRSRP0CLR</name>
					<description>Start logic reset register 0; bottom 32 interrupts</description>
					<addressOffset>0x208</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RSRPIO0_0</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_1</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_2</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_3</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_4</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_5</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_6</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_7</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_8</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_9</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_10</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RSRPIO0_11</name>
							<description>Start signal reset for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_0</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_1</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_2</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_3</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_4</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_5</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_6</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_7</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_8</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_9</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_10</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RSRPIO1_11</name>
							<description>Start signal reset for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_0</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_1</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_2</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_3</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_4</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_5</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_6</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_7</name>
							<description>Start signal reset for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = Do nothing. 1 = Write: reset start signal.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTSRP0</name>
					<description>Start logic status register 0; bottom 32 interrupts</description>
					<addressOffset>0x20C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SRPIO0_0</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SRPIO0_1</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SRPIO0_2</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SRPIO0_3</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SRPIO0_4</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SRPIO0_5</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SRPIO0_6</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SRPIO0_7</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SRPIO0_8</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SRPIO0_9</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SRPIO0_10</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>SRPIO0_11</name>
							<description>Start signal status for start logic input PIO0_n (bit 0 = PIO0_1, ..., bit 11 = PIO0_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SRPIO1_0</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SRPIO1_1</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>SRPIO1_2</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>SRPIO1_3</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>SRPIO1_4</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>SRPIO1_5</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>SRPIO1_6</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>SRPIO1_7</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SRPIO1_8</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>SRPIO1_9</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>SRPIO1_10</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>SRPIO1_11</name>
							<description>Start signal status for start logic input PIO1_n (bit 12 = PIO1_0, ..., bit 23 = PIO1_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>SRPIO2_0</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SRPIO2_1</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>SRPIO2_2</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>SRPIO2_3</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>SRPIO2_4</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>SRPIO2_5</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>SRPIO2_6</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>SRPIO2_7</name>
							<description>Start signal status for start logic input PIO2_n (bit 24 = PIO2_0, ..., bit 31 = PIO2_7). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTAPRP1</name>
					<description>Start logic edge control register 1; top 8 interrupts</description>
					<addressOffset>0x210</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>APRPIO2_8</name>
							<description>Edge select for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>APRPIO2_9</name>
							<description>Edge select for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>APRPIO2_10</name>
							<description>Edge select for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>APRPIO2_11</name>
							<description>Edge select for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>APRPIO3_0</name>
							<description>Edge select for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>APRPIO3_1</name>
							<description>Edge select for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>APRPIO3_2</name>
							<description>Edge select for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>APRPIO3_3</name>
							<description>Edge select for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Falling edge. 1 = Rising edge.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERP1</name>
					<description>Start logic signal enable register 1; top 8 interrupts</description>
					<addressOffset>0x214</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ERPIO2_8</name>
							<description>Enable start signal for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ERPIO2_9</name>
							<description>Enable start signal for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ERPIO2_10</name>
							<description>Enable start signal for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ERPIO2_11</name>
							<description>Enable start signal for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ERPIO3_0</name>
							<description>Enable start signal for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ERPIO3_1</name>
							<description>Enable start signal for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ERPIO3_2</name>
							<description>Enable start signal for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ERPIO3_3</name>
							<description>Enable start signal for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Disabled. 1 = Enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
