lkolbly/cmsis-svd/data/NXP/LPC13xx.svd
						</field>
						<field>
							<name>WDTOSC_PD</name>
							<description>Watchdog oscillator power control in Deep-sleep mode, see Table 49.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXEDVAL2</name>
							<description>Reserved. Always write these bits as 11111.</description>
							<bitRange>[11:7]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>PDAWAKECFG</name>
					<description>Power-down states after wake-up from Deep-sleep mode</description>
					<addressOffset>0x234</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000FDF0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IRCOUT_PD</name>
							<description>IRC oscillator output wake-up configuration</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRC_PD</name>
							<description>IRC oscillator power-down wake-up configuration</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLASH_PD</name>
							<description>Flash wake-up configuration</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD_PD</name>
							<description>BOD wake-up configuration</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC_PD</name>
							<description>ADC wake-up configuration</description>
							<bitRange>[4:4]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSOSC_PD</name>
							<description>System oscillator wake-up configuration</description>
							<bitRange>[5:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTOSC_PD</name>
							<description>Watchdog oscillator wake-up configuration</description>
							<bitRange>[6:6]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSPLL_PD</name>
							<description>System PLL wake-up configuration</description>
							<bitRange>[7:7]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBPLL_PD</name>
							<description>USB PLL wake-up configuration</description>
							<bitRange>[8:8]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXEDVAL0</name>
							<description>Reserved. Always write this bit as 0.</description>
							<bitRange>[9:9]</bitRange>


